pe1mew/greenhouse-Controller/firmware/sdkconfig.defaults
# Greenhouse Controller — sdkconfig defaults (ESP-IDF migration, v2.0.0-alpha.1+)
#
# History
# --------
# Added 1.19.0 (gh#21) as documentation-of-intent for core-dump capture under
# framework=arduino, where these settings had NO EFFECT because PlatformIO's
# prebuilt Arduino-ESP32 framework was built from a baked-in sdkconfig.
#
# Promoted to load-bearing in 2.0.0-alpha.1 (Phase 1 ESP-IDF migration):
# framework=espidf consumes this file directly. Every config value below is
# now meaningful and acted upon by the build.
#
# Editing rules
# --------------
# - Keep this file alphabetised within each section.
# - Do not commit auto-generated `sdkconfig` (gitignored). All non-default
#   settings belong here.
# - One-off interactive tweaks: `pio run -t menuconfig` (which writes to the
#   auto-generated sdkconfig; copy any keepers back here before re-build).

# ----------------------------------------------------------------------------
# Bootloader / log level
# ----------------------------------------------------------------------------
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ----------------------------------------------------------------------------
# Coredump (gh#21 / 1.19.0)
# ----------------------------------------------------------------------------
# Partition for these is defined in partitions.csv at 0x620000 (64 KB).
# First flash on a fresh unit MUST be followed by:
#   esptool.py --chip esp32s3 --port COMx erase_region 0x620000 0x10000
# otherwise the IDF reads garbage at this offset on boot.
CONFIG_ESP_COREDUMP_ENABLE=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=y
CONFIG_ESP_COREDUMP_LOGS=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64
CONFIG_ESP_COREDUMP_STACK_SIZE=1024

# ----------------------------------------------------------------------------
# Flash + PSRAM
# ----------------------------------------------------------------------------
# Matches the verified 1.20.3 runtime config (qio flash, OPI 8 MB PSRAM).
# The board_build.flash_mode = qio in platformio.ini sets the same value for
# the binary header byte that esptool writes during upload.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y

# ----------------------------------------------------------------------------
# FreeRTOS — 1 ms tick (assumed throughout the firmware)
# ----------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
# Dual-core (default for ESP32-S3, listed here for explicitness against any
# future single-core variant of the framework).
CONFIG_FREERTOS_UNICORE=n

# ----------------------------------------------------------------------------
# Partition table (custom layout for dual-bank OTA + dual LittleFS + coredump)
# ----------------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ----------------------------------------------------------------------------
# CPU + compiler
# ----------------------------------------------------------------------------
# ESP32-S3 is the target; lock that in explicitly.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# ----------------------------------------------------------------------------
# mbedTLS — Certificate bundle
# ----------------------------------------------------------------------------
# Phase 4.1 (2.0.0-alpha.4.1) — IDF 5.5's esp-tls REQUIRES an explicit
# server-verification option. The most pragmatic for public HTTPS endpoints
# (Phase-4 tickle hits Google) is the bundled CA store. ~17 KB flash impact.
#
# Default in IDF 5.5 is already y but we set it explicitly so a future
# Kconfig migration can't silently disable it.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ----------------------------------------------------------------------------
# FATFS — Long File Name support
# ----------------------------------------------------------------------------
# Phase 2.11.1 (2.0.0-alpha.2.11.1) — ESP-IDF defaults CONFIG_FATFS_LFN_NONE=y,
# which restricts the SD-card FATFS to 8.3 filenames (8-char base + 3-char ext).
# That broke our test file "phase_2_11_test.csv" (15-char base) and would also
# break production filenames the original arduino-esp32 build wrote freely:
#   - Logger filenames patterned "log_YYYYMMDD_HHMMSS.csv" (~20 chars)
#   - Web assets "manifest.json", "service_worker.js", asset hashes
# Enable LFN with the heap-allocated buffer (max_lfn=255 chars). The HEAP
# variant is the IDF default when LFN is enabled; it keeps the per-open stack
# footprint low at the cost of one heap alloc per directory operation.
# Without this fix, all of LIB-8's create-file paths return STORAGE_ERR_IO
# because FATFS internally returns FR_INVALID_NAME on long names.
#
# IMPORTANT: FATFS_LONG_FILENAMES is a Kconfig `choice` group (radio button)
# in IDF 5.5, NOT a settable bool. The first try at this fix (alpha.2.11.1
# build #1) used `CONFIG_FATFS_LONG_FILENAMES=y` which Kconfig silently
# ignored — the underlying choice option (NONE/HEAP/STACK) remained on its
# default of NONE. Correct form: explicitly mark NONE as unset and HEAP as
# selected. Belt-and-braces for max_lfn so the buffer is large enough for
# the project's longest production filenames.
# CONFIG_FATFS_LFN_NONE is not set
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# ----------------------------------------------------------------------------
# HTTPD — WebSocket support (Phase 6.16-η / 2.0.0-alpha.6.21)
# ----------------------------------------------------------------------------
# Required for the T11 /ws route. Disabled by default in IDF 5.5; enabling
# pulls in the WS framing + handshake code (~6 KB flash) and unlocks the
# httpd_uri_t.is_websocket field, httpd_ws_send_frame_async(),
# httpd_ws_recv_frame(), and httpd_ws_get_fd_info().
CONFIG_HTTPD_WS_SUPPORT=y
